`timescale 1ns / 1ps

module tb_pixel_filter();

    reg clk;
    reg [1:0] sw;
    reg [11:0] pixel_in;
    wire [11:0] pixel_out;

    // เรียกใช้งานโมดูลฟิลเตอร์
    pixel_filter uut (
        .clk(clk),
        .sw(sw),
        .pixel_in(pixel_in),
        .pixel_out(pixel_out)
    );

    always #5 clk = ~clk; // สร้าง Clock จำลอง

    initial begin
        // เริ่มต้น
        clk = 0;
        sw = 2'b00;
        pixel_in = 12'h000;
        #20;

        // ----------------------------------------
        // 1. ทดสอบโหมดปกติ (sw = 00)
        // ----------------------------------------
        sw = 2'b00;
        pixel_in = 12'hF00; #20; // ป้อนสีแดง
        pixel_in = 12'h0F0; #20; // ป้อนสีเขียว
        pixel_in = 12'h00F; #20; // ป้อนสีน้ำเงิน

        // ----------------------------------------
        // 2. ทดสอบโหมด Grayscale (sw = 01)
        // ----------------------------------------
        sw = 2'b01;
        pixel_in = 12'hF00; #20; // สีแดง -> ควรออกเป็นสีเทา (ค่า R=G=B)
        pixel_in = 12'h00F; #20; // สีน้ำเงิน -> ควรออกเป็นสีเทาเข้ม

        // ----------------------------------------
        // 3. ทดสอบโหมด Color Splash (sw = 10) ดูดเฉพาะสีน้ำเงิน
        // ----------------------------------------
        sw = 2'b10;
        pixel_in = 12'hF00; #20; // สีแดง -> ไม่ผ่านเงื่อนไข ควรออกเป็นขาวดำ
        pixel_in = 12'h00F; #20; // สีน้ำเงินเด่น -> ควรออกเป็นสีน้ำเงินเหมือนเดิม

        // ----------------------------------------
        // 4. ทดสอบโหมด Edge Detection (sw = 11)
        // ----------------------------------------
        sw = 2'b11;
        pixel_in = 12'h000; #20; // ดำต่อเนื่อง
        pixel_in = 12'h000; #20; // ไม่มีความต่าง -> ควรเป็นสีดำ
        pixel_in = 12'hFFF; #20; // จู่ๆ เปลี่ยนเป็นสีขาว! (เกิดขอบ) -> ควรเป็นสีขาว
        pixel_in = 12'hFFF; #20; // ขาวต่อเนื่อง ไม่มีความต่าง -> ควรกลับไปเป็นสีดำ

        #100;
        $finish;
    end

endmodule